# TableViewUIUtils Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
TableViewUIUtils Class
Members See Also
---
This utility class contains members that involve the Revit UI and operate on schedule views or MEP electrical panel schedules.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public static class TableViewUIUtils
```

Visual Basic
---
```text
Public NotInheritable Class TableViewUIUtils
```

Visual C++
---
```text
public ref class TableViewUIUtils abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.UI..::..TableViewUIUtils
# See Also
TableViewUIUtils Members
Autodesk.Revit.UI Namespace